# language: ru

Функция: ПроверкаАктивнойСтраницы

  @success
  Сценарий: ПроверкаАктивнойСтраницы
    Дано пользователь заходит на главную страницу Банка Санкт-Петербург
    И проверяет что находится на странице "Частным клиентам"
    Затем переходит на страницу Бизнесу
    И проверяет что находится на странице "Бизнесу"
    Затем переходит на страницу Участникам ВЭД
    И проверяет что находится на странице "Участникам ВЭД"
    Затем переходит на страницу Финансовые рынки
    И проверяет что находится на странице "Финансовые рынки"
    Затем переходит на страницу Private Banking
    И проверяет что находится на странице "Private Banking"
    Затем переходит на страницу Инвесторам
    И проверяет что находится на странице "Инвесторам"
    Затем переходит на страницу Частным клиентам
    И проверяет что находится на странице "Частным клиентам"
    Затем закрывает браузер